Revit 2024 API
BuiltInFailures.SketchFailures Class
 Failures about Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class SketchFailures
Visual Basic
Public NotInheritable Class SketchFailures
Visual C++
public ref class SketchFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SketchFailures
See Also
BuiltInFailures.SketchFailures Members
Autodesk.Revit.DB Namespace